<h3>
	ENDBENUTZER-SOFTWARE-LIZENZVEREINBARUNG F&Uuml;R ROXORITY-SOFTWARE</h3>
<p>
	DIES IST EIN RECHTLICH BINDENDER VERTRAG ZWISCHEN IHNEN (EINER EINZELPERSON ODER
	EINER JURISTISCHEN PERSON) UND ROXORITY LTD. (ROXORITY) BEZ&Uuml;GLICH DER ROXORITY-SOFTWARE,
	ZUGEH&Ouml;RIGEN MEDIEN, PRINT-MATERIALIEN UND ETWAIGEN ONLINE-DOKUMENTATIONEN ODER
	DOKUMENTATIONEN IN ELEKTRONISCHEM FORMAT (&quot;SOFTWARE&quot;). MIT DER INSTALLATION,
	KOPIE ODER ANDERWEITIGEN NUTZUNG DIESES ROXORITY-SOFTWARE-PRODUKTS ERKENNEN SIE
	DIE BINDUNG AN DIE BEDINGUNGEN DIESES VERTRAGES AN, EINSCHLIESSLICH UNTENSTEHENDER
	SOFTWARE-LIZENZ UND SOFTWARE-HAFTUNGSAUSSCHLUSSES. BITTE LESEN SIE DIESES DOKUMENT
	AUFMERKSAM DURCH, BEVOR SIE DIE SOFTWARE ERSTMALIG NUTZEN. SOLLTEN SIE DEN BEDINGUNGEN
	DIESES VERTRAGES NICHT ZUSTIMMEN, D&Uuml;RFEN SIE DIE SOFTWARE NICHT INSTALLIEREN
	ODER NUTZEN.</p>
<h3>
	LIZENZGEW&Auml;HRUNG</h3>
<p>
	In diesem Dokument bezeichnen &quot;Sie&quot; und &quot;Ihr/e&quot; die Person oder
	das Unternehmen, die oder das unten stehend f&uuml;r die Nutzung der Software lizenziert
	wird. &quot;Wir&quot;, &quot;uns&quot; und &quot;unser/e&quot; bezeichnet hierin
	ROXORITY Ltd.</p>
<p>
	Die &quot;Software&quot; bezeichnet in diesem Dokument die ROXORITY-Software &quot;ExportZen&quot;,
	ein Produkt, das &quot;Microsoft SharePoint&quot;-Webseiten um zus&auml;tzliche
	Funktionalit&auml;ten erweitert.
</p>
<p>
	Wir erteilen Ihnen hiermit eine fortw&auml;hrende, nicht-exklusive, nicht-&uuml;bertragbare,
	widerrufbare Lizenz zur Nutzung der Software auf Ihren Client- und Server-Computern.</p>
<p>
	Die Gesamtzahl von SharePoint-&quot;Websitesammlungen&quot; oder &quot;Serverfarmen&quot;,
	auf denen die Software (nach 45-t&auml;giger Nutzung der kostenlosen Testversion)
	&quot;aktiviert&quot; werden kann, ist auf die Anzahl der von Ihnen erworbenen Lizenzen
	beschr&auml;nkt. Sollten Sie beispielsweise 4 Websitesammlungs-Lizenzen erwerben,
	d&uuml;rfen Sie die Software auf bis zu 4 SharePoint-Websitesammlungen aktivieren.
	Sollten Sie beispielsweise 2 Serverfarm-Lizenzen erwerben, d&uuml;rfen Sie die Software
	auf unbegrenzt vielen Websitesammlungen in bis zu 2 SharePoint-Serverfarmen aktivieren.
</p>
<p>
	Eine Lizenz ist auf eine eindeutige Serverfarm- oder Websitesammlung ausgestellt
	und kann nicht auf eine andere Serverfarm / Websitesammlung &uuml;bertragen werden.
</p>
<h3>
	EIGENTUMSRECHTE</h3>
<p>
	In diesem Dokument bezeichnet die Dokumentation alle Materialien in Schriftform,
	die Sie in Verbindung mit der Software erhalten. Wir bleiben einziger und alleiniger
	Eigent&uuml;mer aller Rechte, Eigentumsrechte und Rechtsanspr&uuml;che bez&uuml;glich
	der entsprechenden Software und Dokumentation.</p>
<h3>
	ARCHIVIERUNGS- UND SICHERHEITSKOPIEN</h3>
<p>
	Sie d&uuml;rfen die Software zu Zwecken der Sicherung und Archivierung kopieren,
	unter der Voraussetzung, dass das Original und jede Kopie zu jeder Zeit in Ihrem
	Besitz verbleiben und dass Ihre Installation und Nutzung der Software nicht die
	im obigen Abschnitt &quot;Lizenzgew&auml;hrung&quot; einger&auml;umte &uuml;berschreitet.</p>
<h3>
	UNERLAUBTE HANDLUNGEN</h3>
<p>
	Sie akzeptieren und erkennen an, dass die Software und die Dokumentation gesch&uuml;tzte
	Werke darstellen, die durch die Urheberrechtsgesetze verschiedener L&auml;nder gesch&uuml;tzt
	sind. Sie d&uuml;rfen die Software und die Dokumentation nur zu den hirin genannten
	Zwecken und in &Uuml;bereinstimmung mit den Bedingungen dieses Vertrages nutzen.
	Sie d&uuml;rfen nicht uneingeschr&auml;nkt:</p>
<ul>
	<li>die Dokumentation vervielf&auml;ltigen,</li>
	<li>die Software kopieren, au&szlig;er zur wie oben genannten Erstellung von Archivierungs-
		oder Sicherheitskopien,</li>
	<li>die Software auf einem Server platzieren, so dass sie &uuml;ber ein &ouml;ffentliches
		Netzwerk wie das Internet zug&auml;nglich ist, au&szlig;er wie oben in der &quot;LIZENZGEW&Auml;HRUNG&quot;
		vorgesehen,</li>
	<li>jegliche Bestandteile der Software oder der Dokumentation unterlizenzieren, vermieten,
		verpachten oder verleihen.</li>
</ul>
<p>
	Sie erkennen an, dass jegliche Verletzung dieses Absatzes uns unmittelbaren und
	irreparablen Schaden zuf&uuml;gt, der nur schwer oder unm&ouml;glich gemessen werden
	kann. Daher haben wir bei einer tats&auml;chlichen oder drohenden Verletzung dieses
	Absatzes das Recht auf Erlass einer einstweiligen, vorl&auml;ufigen und endg&uuml;ltigen
	Verf&uuml;gung ohne Sicherheitsleistung, die eine solche Verletzung durch Sie, Ihre
	Rechtsnachfolger oder Abtretungsempf&auml;nger oder jede andere juristische oder
	nat&uuml;rliche Person, die in Absprache mit Ihnen handelt, einschr&auml;nkt oder
	gerichtlich untersagt. Ein solches Rechtsmittel tritt neben und nicht an Stelle
	jeglichen anderen Rechtsmittels, das uns anderweitig durch das Gesetz zur Verf&uuml;gung
	steht.</p>
<h3>
	&Uuml;BERTRAGUNGEN</h3>
<p>
	Sie d&uuml;rfen Ihre Nutzungslizenz f&uuml;r die Software und die Dokumentation
	an eine andere nat&uuml;rliche oder juristische Person (den &quot;Abtretungsempf&auml;nger&quot;)
	abtreten, vorausgesetzt jedoch, dass der Abtretungsempf&auml;nger sich vor einer
	solchen Abtretung schriftlich dazu verpflichtet, sich an die Pflichten, die aus
	diesem Vertrag resultieren, zu binden. Jeder Versuch, die Lizenz an der Software,
	der Dokumentation oder diesen Vertrag abzutreten oder zu &uuml;bertragen ist unwirksam,
	wenn die Abtretung nicht den Bedingungen dieses Absatzes entspricht. Mit Abtretung
	Ihrer Lizenz hierunter stimmen Sie zu, alle Ihre Kopien der Software und der Dokumentation,
	einschlie&szlig;lich aller Kopien von Aktualisierungen und fr&uuml;heren Versionen
	der Software und der Dokumentation, an den Abtretungsempf&auml;nger zu &uuml;bergeben,
	und au&szlig;erdem stimmen Sie zu, dass Sie keinerlei Kopien, ohne Einschr&auml;nkung
	einschlie&szlig;lich elektronischer, auf Computderdisketten oder -laufwerken gespeicherter
	Kopien, behalten.</p>
<h3>
	HAFTUNGSAUSSCHLUSS</h3>
<p>
	Au&szlig;er wenn hierin anders vorgesehen, garantieren wir, dass die Software frei
	von Material- und Fabrikationsfehlern ist und bei normalem Gebrauch f&uuml;r hundertachtzig
	(180) Tage nach Erhalt der Software im Wesentlichen eine der Software-Dokumentation
	entsprechende Leistung erbringt. Unterrichten Sie uns innerhalb dieses Zeitraums
	von hundertachtzig (180) Tagen &uuml;ber jeglichen Mangel an der Software, werden
	wir nach alleinigem Ermessen und auf eigene Kosten die fehlerhafte Software als
	einzige Abhilfe entweder reparieren oder ersetzen. K&ouml;nnen wir die Software
	nicht reparieren oder ersetzen, werden wir die R&uuml;ckgabe der Software auf unsere
	Kosten akzeptieren und den Kaufpreis der Software zur&uuml;ckerstatten.
</p>
<p>
	AUSSER WIE HIERIN FESTGESETZT, WERDEN DIE VON UNS ANGEBOTENE SOFTWARE UND DIE VON
	UNS ANGEBOTENEN DIENSTLEISTUNGEN &quot;WIE BESEHEN&quot; UND &quot;WIE VERF&Uuml;GBAR&quot;
	ZUR VERF&Uuml;GUNG GESTELLT, OHNE JEGLICHE ANDERE ART VON GARANTIE, STILLSCHWEIGEND
	ODER GESETZLICH, EIINSCHLIESSLICH, ABER NICHT BESCHR&Auml;NKT AUF, STILLSCHWEIGENDE
	GARANTIEN HINSICHTLICH DES EIGENTUMSANSPRUCHS, DER FREIHEIT VON RECHTSVERLETZUNGEN,
	DER MARKTG&Auml;NGIGKEIT ODER DER EIGNUNG F&Uuml;R EINEN BESTIMMTEN ZWECK. WIR GARANTIEREN
	NICHT, DASS DIE SOFTWARE ST&Ouml;RUNGSFREI, AKTUELL, ZUVERL&Auml;SSIG, SICHER ODER
	FEHLERFREI SEIN WIRD UND LEHNEN AUSDR&Uuml;CKLICH JEGLICHE GARANTIEN BEZ&Uuml;GLICH
	DER DARIN ENTHALTENEN MATERIALIEN, DER GENUTZTEN SERVER ODER DER VON UNS ANGEBOTENEN
	WAREN ODER DIENSTLEISTUNGEN AB.
</p>
<h3>
	AUSSCHLUSS BESTIMMTER SCH&Auml;DEN</h3>
<p>
	IN KEINEM FALL HAFTET EINE DER PARTEIEN F&Uuml;R SCH&Auml;DEN, EINSCHLIESSLICH ENTGANGENER
	GEWINNE, ENTGANGENER EINSPARUNGEN ODER ANDERER ZUF&Auml;LLIG ENTSTANDENDER SCH&Auml;DEN
	ODER FOLGESCH&Auml;DEN, DIE AUS DER NUTZUNG ODER DER VERHINDERUNG DER NUTZUNG DER
	SOFTWARE ENTSTEHEN (AUCH WENN EINE PARTEI ODER EIN ZUGELASSENER H&Auml;NDLER ODER
	LIEFERANT AUF DIE M&Ouml;GLICHKEIT DIESER SCH&Auml;DEN HINGEWIESEN WURDE), ODER
	F&Uuml;R JEGLICHE ANSPR&Uuml;CHE EINER ANDEREN PARTEI. VON OBENSTEHENDER HAFTUNGSBESCHR&Auml;NKUNG
	AUSGENOMMEN IST DIE SCHADENSERSATZHAFTUNG GEM&Auml;SS DEN FESTSETZUNGEN IN DIESEM
	DOKUMENT SOWIE SCH&Auml;DEN, DIE DURCH GROBE FAHRL&Auml;SSIGKEIT ODER VORS&Auml;TZLICHES
	FEHLVERHALTEN EINER PARTEI VERURSACHT WURDEN.</p>
<h3>
	VERTRAGSLAUFZEIT UND K&Uuml;NDIGUNG</h3>
<p>
	Dieser Vertrag wird wirksam, sobald Sie die Bedingungen dieses Vertrages akzeptieren
	und bleibt wirksam, bis er von einer der Parteien in vertragsgem&auml;&szlig; gek&uuml;ndigt
	wird. Sie k&ouml;nnen diesen Vertrag jederzeit k&uuml;ndigen, indem Sie alle Kopien
	der Software und der Dokumentation, die sich in Ihrem Besitz befinden, zerst&ouml;ren
	und uns hiervon umgehend in Kenntnis setzen. Sollten Sie gegen irgendeine Bedingung
	dieses Vertrages versto&szlig;en, endet dieser Vertrag dadurch automatisch. Mit
	Beendigung dieses Vertrages erkl&auml;ren und gew&auml;hrleisten Sie, unverz&uuml;glich
	alle Kopien der Software und der Dokumentation oder, etwaige andere, im Rahmen dieses
	Vertrags zur Verf&uuml;gung gestellte Materialien, die sich noch in Ihrem Besitz
	befinden, zu zerst&ouml;ren, und uns dies umgehend schriftlich zuzusichern.</p>
<h3>
	VERTRAULICHKEITSBESTIMMUNGEN</h3>
<p>
	Geheimhaltungsvereinbarung. Sie stimmen zu und erkennen an, dass die Software, ihre
	Algorithmen, Protokolle und Schnittstellen, sowie die Dokumentation urheberrechtlich
	gesch&uuml;tzte und vertrauliche Informationen darstellen, die sich in unserem Eigentum
	befinden (die &quot;vertraulichen Informationen&quot;). Weiterhin wissen und akzeptieren
	Sie, dass der Missbrauch und/oder die unbefugte Offenlegung unserer vertraulichen
	Informationen unsere Gesch&auml;ftst&auml;tigkeit negativ beeinflussen k&ouml;nnten.
	Dementsprechend stimmen Sie zu, zu jeder Zeit (a) die vertraulichen Informationen
	nur zum Zwecke dieses Vertrages und nur im zu diesem Zweck notwendigen Umfang zu
	nutzen und zu reproduzieren; (b) die Weitergabe der vertraulichen Informationen
	auf diejenigen Ihrer Mitarbeiter, Berater oder unabh&auml;ngigen Vertragspartner
	zu beschr&auml;nken, die davon wissen m&uuml;ssen, und (c) die vertraulichen Informationen
	ohne unsere vorherige schriftliche Zustimmung nicht an Dritte weiterzugeben. Ungeachtet
	des Vorangegangenen besteht keine Verletzung dieses Vertrages, wenn Sie vertrauliche
	Informationen offenlegen, insofern Sie durch das Gesetz oder im Rahmen einer gerichtlichen
	oder anderen beh&ouml;rdlichen Ermittlung oder eines Verfahrens dazu verpflichtet
	sind, vorausgesetzt jedoch, dass Sie uns vorher &uuml;ber die angestrebte Weitergabe
	informieren und Sie sich vor einer solchen Offenlegung um alle zumutbar zug&auml;nglichen
	Sicherungsma&szlig;nahmen gegen eine ausgedehnte Verbreitung bem&uuml;hen.</p>
<p>
	Rechtsmittel. Sie erkennen an, dass jegliche Verletzung dieses Absatzes uns unmittelbar
	und irreparabel sch&auml;digt und dass die Sch&auml;den, die wir dadurch erleiden,
	schwer oder unm&ouml;glich zu messen sind. Daher haben wir bei einer tats&auml;chlichen
	oder drohenden Verletzung dieses Absatzes das Recht auf Erlass einer einstweiligen,
	vorl&auml;ufigen und endg&uuml;ltigen Verf&uuml;gung ohne Sicherheitsleistung, die
	eine solche Verletzung durch Sie, Ihre Rechtsnachfolger oder Abtretungsempf&auml;nger
	oder jede andere juristische oder nat&uuml;rliche Person, die in Absprache mit Ihnen
	handelt, einschr&auml;nkt oder gerichtlich untersagt. Ein solches Rechtsmittel tritt
	neben und nicht an Stelle jeglichen anderen Rechtsmittels, das uns anderweitig durch
	Gesetz zur Verf&uuml;gung steht.</p>
<h3>
	SCHADENSERSATZ</h3>
<p>
	Wir werden Sie bez&uuml;glich jeder gegen Sie geltend gemachten Klage verteidigen
	und Sie vollkommen schadlos halten (insbesondere einschlie&szlig;lich der Kosten
	und der berechtigten Anwaltsgeb&uuml;hren, die mit einer solchen Klage in Verbindung
	stehen) in dem Umfang, in dem sie auf einem Anspruch beruht, dass die Nutzung der
	Software und jeglicher Dokumentation oder anderer Materialien, die durch Sie im
	Rahmen dieses Vertrags lizenziert sind oder Ihnen zur Verf&uuml;gung gestellt werden,
	ein Patent, Urheberrecht, eine Lizenz oder ein anderes Eigentumsrecht eines Dritten
	verletzt. Sie sind dazu verpflichtet, uns &uuml;ber eine solche Forderung unverz&uuml;glich
	schriftlich zu informieren. Sollte Ihnen als Ergebnis einer Klage aufgrund der Rechtsverletzung
	an einem Patent, Urheberrecht, einer Lizenz oder einem anderen Eigentumsrecht eines
	Dritten die Nutzung der Software gerichtlich untersagt werden oder sollten wir annehmen,
	dass es wahrscheinlich ist, dass die Software Gegenstand einer Klage wegen Rechtsverletzung
	werden wird, werden wir Ihnen nach unserer Wahl und auf unsere Kosten das Recht
	verschaffen, die Software weiter zu nutzen oder die Software ersetzen oder so modifizieren,
	dass sie keine Rechte verletzt oder, sollte dies nicht innerhalb einer angemessenen
	Frist m&ouml;glich sein, die von Ihnen gem&auml;&szlig; dem Vertrag entrichteten
	Preise f&uuml;r die Software zur&uuml;ckerstatten.
</p>
<h3>
	ALLGEMEINE BESTIMMUNGEN</h3>
<ol>
	<li>Dieser Vertrag stellt die vollst&auml;ndige Vereinbarung zwischen Ihnen und uns
		bez&uuml;glich der Software und Dokumentation dar und ersetzt alle vorherigen und
		zeitgleichen Verhandlungen, Diskussionen, Absprachen, Bestellungen, Mitteilungen,
		Ank&uuml;ndigungen oder Erkl&auml;rungen bez&uuml;glich des Gegenstands dieses Dokuments.</li>
	<li>Der gegenw&auml;rtige Vertrag kann nur durch ein von Ihnen und uns unterzeichnetes
		Schriftst&uuml;ck erg&auml;nzt oder ge&auml;ndert werden.</li>
	<li>Im Falle eines Rechtsstreits zwischen Ihnen und uns bez&uuml;glich der Software
		oder der Dokumentation hat die obsiegende Partei des Rechtsstreits das Recht auf
		Erstattung der Anwaltsgeb&uuml;hren und Ausgaben durch die andere Partei.</li>
	<li>Sie stimmen zu, dass die Software in kein Land geliefert, &uuml;bertragen oder exportiert
		wird, wenn dies gegen irgendwelche Exportgesetze, Beschr&auml;nkungen oder Regelungen
		verst&ouml;&szlig;t und auf keine Art genutzt wird, die diese Voraussetzungen erf&uuml;llt.</li>
	<li>Sollte eine der Parteien ihre Rechte aus diesem Vertrag oder aus Verletzung dieses
		Vertrages nicht oder versp&auml;tet aus&uuml;ben, gilt dies nicht als Verzicht auf
		die entsprechenden Rechte oder die Rechtsverletzung selbst.</li>
	<li>Sollte eine Bestimmung dieses Vertrages von einer zust&auml;ndiger Gerichtsbarkeit
		als dem Gesetz widersprechend erachtet werden, wird diese Bestimmung im h&ouml;chsten,
		zul&auml;ssigen Ma&szlig; geltend gemacht und die G&uuml;ltigkeit der &uuml;brigen
		Bestimmungen dieses Vertrages bleibt davon unber&uuml;hrt.</li>
</ol>
