<p>Die folgenden Einstellungen k&ouml;nnen f&uuml;r jede Druck-Launchersammlung durch administrative Benutzer auf der Seite <b>Druck-Launcher</b> in Ihrem <i>PrintZen Studio</i> vorgenommen werden; via Websiteeinstellungen / PrintZen Studio / Druck-Launcher:</p><span>
</span><h4 class="rox-h4 rox-doctab rox-doctab-a"><a href="#" onclick="roxTogDocTab('a');">Register &quot;Allgemein&quot;:</a></h4><span class="rox-doctab rox-doctab-a">
<h3>Name dieser Druck-Launchersammlung</h3>
<p><b>(Texteingabefeld)</b></p><p>Dieser Name wird &uuml;blicherweise Endanwendern nirgends angezeigt, hilft Ihnen aber gegebenenfalls, die &Uuml;bersicht zu behalten.</p>
<h3>Diese Druck-Launchersammlung ist...</h3>
<p><b>(Definierung einer Untermenge an SharePoint-Websites)</b></p><p>Optional: w&auml;hlen Sie aus, in welchen Websites diese Druck-Launchersammlung verf&uuml;gbar sein wird. Standardm&auml;&szlig;ig steht Sie allen Websites zur Verf&uuml;gung und dies mu&szlig; normalerweise bei der Ersteinrichtung dieser Software auch vorerst nicht ge&auml;ndert werden. Nehmen Sie nur &Auml;nderungen vor, wenn Sie mit der in obigen Steuerelementen verwendeten Terminologie vertraut sind. Sollten Ihre &Auml;nderungen nicht die erwarteten Wirkungen erzielen, k&ouml;nnen Sie diese jederzeit auf "in allen Websites ohne Ausnahmen verf&uuml;gbar" zur&uuml;cksetzen und erneut inkrementell mit Ihren Ausnahmen experimentieren.</p>
<p>Um eine Menge an SharePoint-Websites zu beschreiben, w&auml;hlen Sie zun&auml;chst entweder <b>verf&uuml;gbar in allen Websites</b> oder <b>verf&uuml;gbar in keinen Websites</b>, und klicken Sie dann auf den Link <b>au&szlig;er...</b>, um nun zu definieren, welche Websites aus dieser Vorauswahl ausgeschlossen werden sollen. Ausgeschlossen werden k&ouml;nnen:
<ul>
<li>die Stammwebsite (der jeweils aktuellen Websitesammlung)</li>
<li>Websites auf Basis der ausgew&auml;hlten Sitedefinitionen</li>
<li>oder Websites mit den angegebenen Titeln, URL-Pfadfragmenten oder IDs.</li>
</ul></p>
<h3>Beschriftung f&#252;r Druck-Launcher</h3>
<p><b>(Texteingabefeld)</b></p><p>Geben Sie die Beschriftung dieser Druck-Launcher an, die in Websiteaktionen-Men&uuml;s, die diese Druck-Launcher verwenden, angezeigt werden soll. (Geben Sie keine Beschriftung an, so wird der oben angegebene Name f&uuml;r diese Druck-Launcher verwendet, oder falls ebenfalls leer, ihre interne ID.)</p>
<p>Standardwert f&#252;r neue Druck-Launcher:</p>
<pre>$Resources:Tool_PrintControls_DefTitle</pre>
<h3>Beschreibung f&#252;r Druck-Launcher</h3>
<p><b>(Texteingabefeld)</b></p><p>Geben Sie die Beschreibung dieser Druck-Launcher an, die in Websiteaktionen-Men&uuml;s, die diese Druck-Launcher verwenden, angezeigt werden soll.</p>
</span><h4 class="rox-h4 rox-doctab rox-doctab-c"><a href="#" onclick="roxTogDocTab('c');">Register &quot;Verf&#252;gbarkeit und Druckbefehle&quot;:</a></h4><span class="rox-doctab rox-doctab-c">
<h3>In &quot;Websiteaktionen&quot; anbieten (erfordert aktives Websitesammlungsfeature)</h3>
<p><b>(Ankreuzbares Kontrollfeld)</b></p><p>Falls angekreuzt (und bei aktiviertem Websitesammlungsfeature <b>PrintZen Men&uuml;integration</b>) werden alle von dieser Druck-Aufrufsammlung angebotenen Druckbefehle in ihrem eigenen Untermen&uuml; (welches die oben angegebene Beschriftung und Beschreibung anzeigt) innerhalb des SharePoint-eigenen <i>Websiteaktionen</i>-Men&uuml;s angeboten.</p>
<h3>Drucken des Seiteninhaltsbereichs anbieten, wenn m&#246;glich</h3>
<p><b>(Ankreuzbares Kontrollfeld)</b></p><p>Falls angekreuzt, bietet dieser Launcher eine Druck-Ansicht f&uuml;r den gesamten Seiteninhalt (ohne Seitenchrom- und Navigationsartefakte wie Ribbon, Top-Navigation, Schnellstartleiste etc.) an.</p>
<h3>Drucken einzelner Webparts anbieten, wenn m&#246;glich</h3>
<p><b>(Ankreuzbares Kontrollfeld)</b></p><p>Falls angekreuzt, bietet dieser Launcher individuelle Druck-Ansichten f&uuml;r jedes einzelne Webpart auf der aktuellen Seite an.</p>
<h3>Drucken einzelner Webpartzonen anbieten, wenn m&#246;glich</h3>
<p><b>(Ankreuzbares Kontrollfeld)</b></p><p>Falls angekreuzt, bietet dieser Launcher individuelle Druck-Ansichten f&uuml;r jede einzelne Webpartzone auf der aktuellen Seite an.</p>
</span>
