<p>Die folgenden Einstellungen finden administrative Benutzer auf der Seite <span id="roxconfiglink"><i>Konfiguration</i> im <i>UploadZen-Studio</i>, welches Sie &uuml;ber Websiteeinstellungen / UploadZen Studio / Konfigurationseinstellungen erreichen</span>.</p><p>Jede Einstellung hat einen globalen, &uuml;ber die gesamte Serverfarm hinweg geltenden Wert, der jeweils optional auf Websitesammlungsebene &uuml;berschrieben werden kann. Die folgenden Konfigurationseinstellungen stehen zur Verf&uuml;gung:</p>
<h3>Sprache</h3>
<p>UploadZen wurde f&uuml;r verschiedene Sprachen lokalisiert. Zus&auml;tzlich zu Englisch und Deutsch werden hier alle Sprachen zur Auswahl angeboten, f&uuml;r die Sie eigene Teil&uuml;bersetzungen (unter Websiteeinstellungen / UploadZen Studio / DIY-Benutzeroberfl&auml;chen-Lokalisierung) angefertigt haben. Diese Einstellung betrifft alle UploadZen-Benutzeroberfl&auml;chen au&szlig;er Beschriftungen und Beschreibungen von Features, Listenvorlagen, Spaltentypen, Inhaltstypen oder Webpartvorlagen (diese werden von SharePoint immer direkt gem&auml;&szlig; der aktiven Website-Spracheinstellung geladen).</p>
<p><strong>W&auml;hlen Sie aus folgenden Optionen</strong> auf der Seite <i>Konfiguration</i> im <i>UploadZen-Studio</i>:</p>
<ul>
<li><i>(Wie Site, oder Englisch)</i></li>
<li><i>English</i></li>
<li><i>Deutsch</i></li>
</ul>
<h3>SharePoint-eigenen &quot;Mehrere Dokumente hochladen&quot;-Men&#252;befehl deaktivieren</h3>
<p>Standardm&auml;&szlig;ig koexistieren Ihre UploadZen-Aktionen parallel zum bereits in SharePoint eingebauten "Mehrere Dokumente hochladen"-Originalbefehl. Wollen Sie letztere Funktionalit&auml;t komplett durch UploadZen ersetzen, k&ouml;nnen Sie hier anpassen, ob und wann SharePoints eigener Multi-Uploadbefehl deaktiviert werden soll (betrifft sowohl das "Hochladen"-Men&uuml; in der Toolbar von SharePoint 2007-Bibliotheken als auch die Ribbonschaltfl&auml;che der "Dokumente / Neu"-Gruppe im "Bibliothek"-Ribbontab von SharePoint 2010/2013).</p>
<p><strong>W&auml;hlen Sie aus folgenden Optionen</strong> auf der Seite <i>Konfiguration</i> im <i>UploadZen-Studio</i>:</p>
<ul>
<li><i>Nie</i></li>
<li><i>Nur wenn Upload-Aktionen existieren (bei aktiviertem Websitesammlungsfeature)</i></li>
<li><i>Immer (bei aktiviertem Websitesammlungsfeature)</i></li>
</ul>
<h3>SharePoint-eigenen &quot;Mehrere Dateien hochladen&quot;-Link auf der Einzeldatei-Uploadseite ausblenden</h3>
<p>Standardm&auml;&szlig;ig koexistieren Ihre UploadZen-Aktionen parallel zum bereits in SharePoint eingebauten "Mehrere Dateien hochladen"-Link auf der <b>UploadZen-Ersatzseite f&uuml;r Upload.aspx</b> (bei entsprechend aktiviertem Websitesammlungsfeature). Wollen Sie die eingebaute Funktionalit&auml;t komplett durch UploadZen ersetzen, k&ouml;nnen Sie hier anpassen, ob und wann SharePoints eigener Multi-Uploadlink auf der Einzeldatei-Uploadseite angezeigt werden soll.</p>
<p><strong>W&auml;hlen Sie aus folgenden Optionen</strong> auf der Seite <i>Konfiguration</i> im <i>UploadZen-Studio</i>:</p>
<ul>
<li><i>Nie</i></li>
<li><i>Nur wenn Upload-Aktionen existieren (bei aktiviertem Websitesammlungsfeature)</i></li>
<li><i>Immer (bei aktiviertem Websitesammlungsfeature)</i></li>
</ul>
<h3>Berechtigungskontext f&#252;r Ribbon- bzw. Toolbar-Men&#252;befehle</h3>
<p><b>Die Standardeinstellung ist hier die empfohlene Auswahl und wir raten davon ab, diese zu &auml;ndern au&szlig;er bei Vorliegen triftiger Gr&uuml;nde.</b><br/><br/>W&auml;hlen Sie die Berechtigungen aus, mit welchen Endanwender die von dieser Software angebotenen Ribbon- bzw. Toolbar-Men&uuml;befehle ausf&uuml;hren d&uuml;rfen.</p>
<p><strong>W&auml;hlen Sie aus folgenden Optionen</strong> auf der Seite <i>Konfiguration</i> im <i>UploadZen-Studio</i>:</p>
<ul>
<li><i>AddAndCustomizePages</i></li>
<li><i>AddDelPrivateWebParts</i></li>
<li><i>AddListItems</i></li>
<li><i>ApplyStyleSheets</i></li>
<li><i>ApplyThemeAndBorder</i></li>
<li><i>ApproveItems</i></li>
<li><i>BrowseDirectories</i></li>
<li><i>BrowseUserInfo</i></li>
<li><i>CancelCheckout</i></li>
<li><i>CreateAlerts</i></li>
<li><i>CreateGroups</i></li>
<li><i>CreateSSCSite</i></li>
<li><i>DeleteListItems</i></li>
<li><i>DeleteVersions</i></li>
<li><i>EditListItems</i></li>
<li><i>EditMyUserInfo</i></li>
<li><i>EmptyMask</i></li>
<li><i>EnumeratePermissions</i></li>
<li><i>FullMask</i></li>
<li><i>ManageAlerts</i></li>
<li><i>ManageLists</i></li>
<li><i>ManagePermissions</i></li>
<li><i>ManagePersonalViews</i></li>
<li><i>ManageSubwebs</i></li>
<li><i>ManageWeb</i></li>
<li><i>Open</i></li>
<li><i>OpenItems</i></li>
<li><i>UpdatePersonalWebParts</i></li>
<li><i>UseClientIntegration</i></li>
<li><i>UseRemoteAPIs</i></li>
<li><i>ViewFormPages</i></li>
<li><i>ViewListItems</i></li>
<li><i>ViewPages</i></li>
<li><i>ViewUsageData</i></li>
<li><i>ViewVersions</i></li>
</ul>
<p>Falls Sie diese Einstellung angepa&szlig;t haben, k&ouml;nnen Sie &uuml;ber den Link <b>Auf Standardwert zur&uuml;cksetzen</b> auf der Seite <i>Konfiguration</i> im <i>UploadZen-Studio</i> folgenden Standardwert wiederherstellen:</p>
<pre>AddListItems</pre>
<h3>Filtersets f&#252;r Dateinamenerweiterungen (Dateiendungen)</h3>
<p>Sie k&ouml;nnen in Ihrer Upload-Aktion unter Websiteeinstellungen / UploadZen Studio / Upload-Aktionen festlegen, da&szlig; Endanwender nur Dateien bestimmter Typen hochladen d&uuml;rfen. Falls Sie diese Art der Dateitypfilterung aktivieren, l&auml;&szlig;t Ihre Upload-Aktion Sie mehrere aus den hier definierten Filtersets ausw&auml;hlen. Jedes Filterset wird in einer eigenen Zeile definiert und enth&auml;lt einen Namen (verwenden Sie hier keinerlei Kommata!), danach einen Doppelpunkt [:] und dann alle zugelassenen Dateinamenerweiterungen (Dateiendungen) ohne Punkte, durch Kommata kombiniert.</p>
<p>Falls Sie diese Einstellung angepa&szlig;t haben, k&ouml;nnen Sie &uuml;ber den Link <b>Auf Standardwert zur&uuml;cksetzen</b> auf der Seite <i>Konfiguration</i> im <i>UploadZen-Studio</i> folgenden Standardwert wiederherstellen:</p>
<pre>Documents (*.pdf; *.doc; *.rtf etc.):123,602,cgm,csv,dbf,dif,doc,docx,docm,dot,dotx,hta,htm,html,hwp,mml,odb,odf,odm,odp,ods,odt,oth,otp,ott,pdb,pdf,pot,potm,potx,pps,ppt,pptm,pptx,psw,pxl,rtf,sdc,sdp,sdw,sgl,slk,smf,stc,sti,stw,sxc,sxg,sxm,sxi,sxw,txt,uof,uos,uof,uop,uot,vor,wb2,wpd,wk1,wks,wri,xlc,xlm,xltm,xltx,xls,xlsb,xlsm,xlsx,xlt,xlw,xml<br/>Pictures (*.jpg; *.png; *.gif etc.):bmp,dxf,dib,emf,eps,gif,ico,jfif,jif,jpe,jpeg,jpg,met,odg,otg,pbm,pcd,pct,pcx,pgm,pict,png,ppm,psd,ras,sda,sdd,sgf,sgv,std,svm,svg,sxd,tga,tif,tiff,vor,wmf,xbm,xpm<br/>Web Parts (*.dwp; *.webpart):dwp,webpart<br/>List Template / Site Template / Solution Packages (*.stp; *.cab; *.wsp):stp,cab,wsp<br/>Master Pages (*.master):master<br/>Compressed File Archives (*.zip; *.rar etc.):zip,rar,wsp,stp,cab,arj,lzh,ace,tar,gz,gzip,uue,bz2,jar,iso,z,7z</pre>
<h3>Alternativer Pfad f&#252;r tempor&#228;re Ablage von Dateist&#252;ckelungen</h3>
<p>Sie m&uuml;ssen zwingend einen alternativen Pfad festlegen, wenn Sie die Dateist&uuml;ckelungs-Funktion (Chunking, aktivierbar pro Upload-Aktion) in einer Multiserver-Farmumgebung einsetzen wollen. In einer Einzelserver-Farm oder bei Verzicht auf die St&uuml;ckelungs-/Chunkingfunktion kann diese Einstellung ignoriert werden. Andernfalls lesen Sie zun&auml;chst alle Details im Abschnitt <b>Preparing a Web Application for the Chunking feature</b> des UploadZen-Hilfethemas <b>Deployment-Checkliste</b>.<br/><br/>Wenn diese Einstellung nicht gesetzt ist, wird standardm&auml;&szlig;ig der physikalische Verzeichnispfad verwendet, der dem virtuellen Verzeichnispfad _layouts/roxority_UploadZen/fc entspricht. Falls diese Einstellung gesetzt werden soll, m&uuml;ssen Sie diese auf einen von allen Web-Frontendservern zentral zug&auml;nglichen Speicherort setzen, z.B. ein Netzwerklaufwerk, gemeinsamen Order oder &auml;hnliches.</p>
<h3>Einchecken-Auswahl ausblenden wenn deaktiviert</h3>
<p></p>
<h3>Alle in der Bereitstellungs-Checkliste beschriebenen administrativen Schritte wurden durchgef&#252;hrt</h3>
<p>Kreuzen Sie auf der Seite <i>Konfiguration</i> im <i>UploadZen-Studio</i> diese Option an erst, nachdem Sie die <a href="?doc=clickonce_deployment_checklist">Bereitstellungs-Checkliste</a> f&uuml;r den ClickOnce Windows-Uploader vollst&auml;ndig gelesen und alle beschriebenen, f&uuml;r die korrekte Ausf&uuml;hrung von UploadZen Windows-Uploader bei Ihren Benutzern <i>erforderlichen</i> administrativen Schritte durchgef&uuml;hrt haben. (Dies blendet die entsprechende Erinnerungsnotiz im UploadZen-Fenster aus, wenn UploadZen das n&auml;chste Mal von einer neu geladenen Seite aufgerufen wird.)</p>
<h3>Fehlermeldungen enthalten immer s&#228;mtliche Debug- und Diagnosedetails</h3>
<p>Standardm&auml;&szlig;ig wird f&uuml;r bestimmte von UploadZen abgefangene und an Endanwender weitergegebene Fehler nur die Fehlermeldung angezeigt. Zu Debug- und Diagnosezwecken kann es indes mitunter tempor&auml;r vorteilhaft sein, alle bekannten Fehlerdetails anzuzeigen (wie z.B. innere Ausnahmen oder die Stapelverfolgung), im laufenden Dauerbetrieb jedoch w&uuml;rden solche detaillierten Meldungen Ihre Anwender verwirren oder verschrecken. Kreuzen Sie diese Option an, um immer alle bekannten Fehlerdetails in Ihren Endbenutzerschnittstellen anzuzeigen.</p>
<h3>Verz&#246;gerung pro Einzeldatei in Sekunden</h3>
<p>Unter bestimmten Umst&auml;nden m&uuml;ssen Sie ggf. Drittanbieter- oder eigenentwickelte Event-Handler integrieren, die besser arbeiten, wenn es zwischen einzelnen Dokumentbibliotheksereignissen zeitliche Pausen gibt. Geben Sie die Anzahl an Sekunden an, die UploadZen k&uuml;nstlich jeden Upload verz&ouml;gern soll. Wenn Sie keine g&uuml;ltige Ganzzahl angeben, so wird der empfohlene Standardwert 0 verwendet.</p>
<p>Falls Sie diese Einstellung angepa&szlig;t haben, k&ouml;nnen Sie &uuml;ber den Link <b>Auf Standardwert zur&uuml;cksetzen</b> auf der Seite <i>Konfiguration</i> im <i>UploadZen-Studio</i> folgenden Standardwert wiederherstellen:</p>
<pre>0</pre>
<h3>Keine Standardinstanzen f&#252;r UploadZen-Konfiguratoren auf Websitesammlungsebene (NICHT empfohlen!)</h3>
<p>Konfiguratoren sind Listen von Elementen, die das Verhalten dieser Software definieren bzw. anpassen (wie Export-Aktionen in ExportZen, Datenquellen und Datenfeldvorlagen in PeopleZen, Druckansichten und Druck-Launcher in PrintZen, Upload-Aktionen in UploadZen). Standardm&auml;&szlig;ig besitzt jede Websitesammlung f&uuml;r jeden Konfigurator ihre eigene, nicht entfernbare Standardinstanz , die angepa&szlig;t werden kann oder zu der weitere hinzugef&uuml;gt werden k&ouml;nnen. In sehr gro&szlig;en Serverfarmen mit 1000en von Websitesammlungen k&ouml;nnen diese Standardinstanzen eher hinderlich sein und der ausschlie&szlig;liche Einsatz von Instanzen auf Farmebene pr&auml;feriert werden. Kreuzen Sie diese Option an, um die Standardinstanz-pro-Websitesammlung zu deaktivieren.</p>
<h3>Standardm&#228;&#223;ig keine Einbindung der jQuery-Bibliothek v1.8.3 (NICHT empfohlen)</h3>
<p>Einige UploadZen-Benutzeroberfl&auml;chen erfordern die jQuery-Bibliothek und binden diese in die entsprechenden Seiten ein. Mehrfacheinbindung von jQuery kann manchmal zu Problemen f&uuml;hren. Kreuzen Sie auf der Seite <i>Konfiguration</i> im <i>UploadZen-Studio</i> diese Option an <i>nur</i>, wenn Ihre Masterseiten, Webpartseiten oder Drittanbietererweiterungen eigenst&auml;ndig, global (nicht nur in Einzelf&auml;llen) und unabh&auml;ngig von UploadZen ebenfalls jQuery einbinden, um UploadZen davon abzuhalten, jQuery einzubinden. Ist diese Option aktiviert, m&uuml;ssen Sie selbst&auml;ndig sicherstellen, dass jQuery (in einer Version neuer als 1.4 ABER &auml;lter als 1.9) in Seiten geladen wird, die UploadZen-Benutzeroberfl&auml;chen enthalten, andernfalls wird UploadZen unter Umst&auml;nden nicht mehr funktionieren. Dies ist eine globale Voreinstellung, die lokal ggf. noch einmal individuell &uuml;berschrieben werden kann.</p>
