<p>Die folgenden Einstellungen finden administrative Benutzer auf der Seite <span id="roxconfiglink"><i>Konfiguration</i> im <i>FilterZen-Studio</i>, welches Sie &uuml;ber Websiteeinstellungen / FilterZen Studio / Konfigurationseinstellungen erreichen</span>.</p><p>Jede Einstellung hat einen globalen, &uuml;ber die gesamte Serverfarm hinweg geltenden Wert, der jeweils optional auf Websitesammlungsebene &uuml;berschrieben werden kann. Die folgenden Konfigurationseinstellungen stehen zur Verf&uuml;gung:</p>
<h3>Sprache</h3>
<p>FilterZen wurde f&uuml;r verschiedene Sprachen lokalisiert. Zus&auml;tzlich zu Englisch und Deutsch werden hier alle Sprachen zur Auswahl angeboten, f&uuml;r die Sie eigene Teil&uuml;bersetzungen (unter Websiteeinstellungen / FilterZen Studio / DIY-Benutzeroberfl&auml;chen-Lokalisierung) angefertigt haben. Diese Einstellung betrifft alle FilterZen-Benutzeroberfl&auml;chen au&szlig;er Beschriftungen und Beschreibungen von Features, Listenvorlagen, Spaltentypen, Inhaltstypen oder Webpartvorlagen (diese werden von SharePoint immer direkt gem&auml;&szlig; der aktiven Website-Spracheinstellung geladen).</p>
<p><strong>W&auml;hlen Sie aus folgenden Optionen</strong> auf der Seite <i>Konfiguration</i> im <i>FilterZen-Studio</i>:</p>
<ul>
<li><i>(Wie Site, oder Englisch)</i></li>
<li><i>English</i></li>
<li><i>Deutsch</i></li>
</ul>
<h3>Auswahlbegrenzung von Drop-Down-Filtern</h3>
<p>Interaktive Drop-Down-Filter (wie Auswahl-, Listen-Lookup-, SQL-, Benutzer- und BCS/BDC-Filter) verwenden diesen Schwellenwert, um die Anzahl der Auswahlm&ouml;glichkeiten zu begrenzen. Dies ist sowohl aus Performance- als auch aus Usabilitygr&uuml;nden empfehlenswert. Um die Begrenzung zu deaktivieren (nicht empfohlen), verwenden Sie den Wert 0. Geben Sie keine g&uuml;ltige Ganzzahl an, wird der Standardwert 150 verwendet.</p>
<p>Falls Sie diese Einstellung angepa&szlig;t haben, k&ouml;nnen Sie &uuml;ber den Link <b>Auf Standardwert zur&uuml;cksetzen</b> auf der Seite <i>Konfiguration</i> im <i>FilterZen-Studio</i> folgenden Standardwert wiederherstellen:</p>
<pre>150</pre>
<h3>Behandlung des &#39;In Datenblatt bearbeiten&#39;-Befehls</h3>
<p>Datenblattansichten unterst&uuml;tzen keine Webpartverbindungen, und statt diese einfach zu ignorieren, zeigen sie leider meist nur eine Fehlermeldung an. Dies l&auml;&szlig;t sich entweder l&ouml;sen, indem Sie die Option <b>Auf Seiten mit nichts als einer einzelnen Listenansicht, diese automatisch filternd ansteuern (ohne Webpart-Verbindung)</b> f&uuml;r das betreffende FilterZen-Webpart unter <i>Erweiterte Filteroptionen</i> ankreuzen (nur SharePoint 2010/2013) &mdash; oder alternativ k&ouml;nnen Sie der Liste eine neue, separate, dedizierte (&ouml;ffentliche) <i>Datenblatt-Ansicht</i> manuell hinzuf&uuml;gen, und wenn Sie dann noch hier die &#39;Auto-Weiterleitung&#39; ausw&auml;hlen, so wird FilterZen Ihre Anwender k&uuml;nftig automatisch zu dieser separaten Datenblattansicht weiterleiten, wenn diese &#39;In Datenblatt bearbeiten&#39; auf einer Nicht-Datenblatt-Ansicht ausw&auml;hlen. (Hinweis: die Datenblattansicht l&auml;&szlig;t sich unter SharePoint 2010/2013 auf Listenebene &uuml;ber Listeneintellungen / Erweiterte Einstellungen deaktivieren.)</p>
<p><strong>W&auml;hlen Sie aus folgenden Optionen</strong> auf der Seite <i>Konfiguration</i> im <i>FilterZen-Studio</i>:</p>
<ul>
<li><i>Problem ignorieren (Microsoft-Fehlermeldung)</i></li>
<li><i>Auto-Weiterleitung falls Datenblatt-Ansicht vorhanden</i></li>
</ul>
<h3>Im CAML-Direct-Filtermodus Listenansicht-Ordnerzeige nur bei aktiven Filtern &#252;berschreiben (in SharePoint 2010/2013 nur eingeschr&#228;nkt unterst&#252;tzt)</h3>
<p>Der CAML-Direct-Filtermodus erlaubt es bei Verbindung mit Listenansicht-Webparts, die <i>&quot;Anzeige von Ordnern zu &uuml;berschreiben&quot;</i>. Kreuzen Sie auf der Seite <i>Konfiguration</i> im <i>FilterZen-Studio</i> diese Option an, um die Ordneranzeige nur dann zu &uuml;berschreiben, wenn aktive Filterwerte gesendet wurden. Bleibt diese Option hingegen deaktiviert, wird die Ordneranzeige immer wie eingestellt &uuml;berschrieben, auch wenn keine Filter angewendet wurden.</p>
<h3>Benutzerdefinierte Bild-URL f&#252;r &quot;Laden...&quot;-Animation</h3>
<p>Wenn Filter neu angewendet oder zur&uuml;ckgesetzt werden, zeigt FilterZen standardm&auml;&szlig;ig eine SharePoint-typische Animation (den gr&uuml;nen Kreisel), um anzudeuten, da&szlig; der Vorgang durchgef&uuml;hrt wird. Falls zwecks Designanpassungen oder Branding gew&uuml;nscht, k&ouml;nnen Sie hierf&uuml;r eine alternative Bild-URL angeben. Dies kann sowohl eine absolute als auch eine server-relative URL wie z.B. /_layouts/images/roxority_FilterZen/k.gif sein.</p>
<h3>In Listen-basierten AutoVervollst&#228;ndigen-Dropdowns von Textfiltern verwenden 1-Zeichen-Eintr&#228;ge Beginnt-mit statt Enth&#228;lt</h3>
<p>Wenn mit Listenansicht-Webparts verbunden, k&ouml;nnen Textfilter Endanwendern optional <b>"Listenbasierte Suchvorschl&auml;ge (Auto-Vervollst&auml;ndigen), wenn m&ouml;glich"</b> anbieten, um &uuml;ber Suchen-w&auml;hrend-Texteingabe Vorschl&auml;ge zur Vervollst&auml;ndigung der Eingabe anzubieten. Dieses Dropdown (immer begrenzt auf die hierunter konfigurierte Maximalanzahl an Eintr&auml;gen) l&ouml;st eine AJAX-Suche in der verbundenen Liste f&uuml;r die vom Textfilter angesteuerte Spalte aus und z&auml;hlt gefundene Spaltenwerte auf, die den aktuellen Textboxinhalt enthalten. F&uuml;r gro&szlig;e Datenmengen kann es sinnvoller sein, bei Eingabe von nur einem Zeichen nur Werte aufzuz&auml;hlen, die mit diesem beginnen (statt es enthalten), so da&szlig; die Eingabe von B alle Werte anbieten, die mit B beginnen. Der m&ouml;gliche Nachteil besteht in einer potentiellen Verwirrung von Endanwendern durch das wechselhafte Verhalten von Beginnt-mit vs. Enth&auml;lt, da das Dropdown bei Eingabe weiterer Zeichen grunds&auml;tzlich wieder auf das Enth&auml;lt-Verhalten zur&uuml;ckschaltet. (Hinweis: wurde der Filteroperator des Textfilters auf Beginnt-mit voreingestellt, so verwendet auch dessen AutoVervollst&auml;ndigen-Dropdown ausnahmslos Beginnt-mit und nie Enth&auml;lt, unabh&auml;ngig von dieser Einstellung.) Kreuzen Sie diese Option an, um bei 1-Zeichen-Eingaben f&uuml;r das AutoVervollst&auml;ndigen-Dropdown immer Beginnt-mit statt Enth&auml;lt zu verwenden.</p>
<h3>Maximale Anzahl an Elementen in Listen-basierten AutoVervollst&#228;ndigen-Dropdowns von Textfiltern</h3>
<p>Werden in einem AutoVervollst&auml;ndigen-Dropdown mehr als bspw. 20-30 Eintr&auml;ge angeboten, werden die meisten Endanwender wahrscheinlich eher ihre Texteingabe pr&auml;zisieren als hunderte von Eintr&auml;gen zu scannen, und ein niedrig gehaltenes Limit wird zudem die Performance von AutoVervollst&auml;ndigen-Dropdowns in Textfiltern stark verbessern. Um diese Begrenzung anzupassen, geben Sie einen ganzzahligen Wert h&ouml;her als 1 ein, andernfalls wird der Standardwert von 40 verwendet.</p>
<p>Falls Sie diese Einstellung angepa&szlig;t haben, k&ouml;nnen Sie &uuml;ber den Link <b>Auf Standardwert zur&uuml;cksetzen</b> auf der Seite <i>Konfiguration</i> im <i>FilterZen-Studio</i> folgenden Standardwert wiederherstellen:</p>
<pre>40</pre>
<h3>Endanwenderinstruktionen f&#252;r Listen-basierte AutoVervollst&#228;ndigen-Dropdowns von Textfiltern</h3>
<p>Falls gew&uuml;nscht, k&ouml;nnen Sie hier einen hilfreichen Hinweise f&uuml;r Ihre Endanwender verfassen, der dann in allen Listen-basierten AutoVervollst&auml;ndigen-Dropdowns von Textfiltern am unteren Rand angezeigt wird.</p>
<p>Falls Sie diese Einstellung angepa&szlig;t haben, k&ouml;nnen Sie &uuml;ber den Link <b>Auf Standardwert zur&uuml;cksetzen</b> auf der Seite <i>Konfiguration</i> im <i>FilterZen-Studio</i> folgenden Standardwert wiederherstellen:</p>
<pre>(Zeigt max. 40 Ergebnisse)</pre>
<h3>Nichtfilter-Parameternamen (Seitenaufruf- / URL-Filter)</h3>
<p>Wenn Sie Catch-All-Seitenaufruffilter verwenden, geben Sie optional die Seitenaufrufparameter an (einen pro Zeile), die nie als Filter gesendet werden sollen. Es wird empfohlen, hier immer auch SharePoint-typische URL-Parameter (wie die im Standardwert dieser Einstellung vorhandenen) mit anzugeben.</p>
<p>Falls Sie diese Einstellung angepa&szlig;t haben, k&ouml;nnen Sie &uuml;ber den Link <b>Auf Standardwert zur&uuml;cksetzen</b> auf der Seite <i>Konfiguration</i> im <i>FilterZen-Studio</i> folgenden Standardwert wiederherstellen:</p>
<pre>ContentTypeId<br/>DisplayMode<br/>FolderCTID<br/>InitialTabId<br/>IsDlg<br/>Paged<br/>PageView<br/>PageFirstRow<br/>RootFolder<br/>SortDir<br/>SortField<br/>Source<br/>View<br/>VisibilityContext<br/>p_ID<br/>p_FSObjType<br/>p_FileLeafRef<br/>p_Title<br/>FilterField1<br/>FilterValue1<br/>FilterField2<br/>FilterValue2<br/>FilterField3<br/>FilterValue3<br/>FilterField4<br/>FilterValue4<br/>FilterField5<br/>FilterValue5<br/>FilterField6<br/>FilterValue6</pre>
<h3>ADO.NET-Datenbankverbindungsanbieter f&#252;r SQL-Datenzugriff</h3>
<p>Geben Sie alle ADO.NET-Datenbankverbindungsanbieter an, die von Ihren Datenbank/SQL-Datenquellen unterst&uuml;tzt werden sollen (einen pro Zeile nach dem Muster "Anzeigename: voller Anbieter-IDbConnection-Typname, voller Assemblyname").</p>
<p>Falls Sie diese Einstellung angepa&szlig;t haben, k&ouml;nnen Sie &uuml;ber den Link <b>Auf Standardwert zur&uuml;cksetzen</b> auf der Seite <i>Konfiguration</i> im <i>FilterZen-Studio</i> folgenden Standardwert wiederherstellen:</p>
<pre>SQL Server: System.Data.SqlClient.SqlConnection, System.Data<br/>Oracle: System.Data.OracleClient.OracleConnection, System.Data.OracleClient<br/>ODBC: System.Data.Odbc.OdbcConnection, System.Data<br/>OLE DB: System.Data.OleDb.OleDbConnection, System.Data</pre>
<h3>Trennzeichenfolge zur Einr&#252;ckung hierarchischer ausw&#228;hlbarer Listenlookup-Filterwerte</h3>
<p>Falls Sie diese Funktion ben&ouml;tigen, lesen oder schreiben Sie in der <a href="http://roxority.com/filterzen-forum/post/1221588">dazugeh&ouml;rigen Forumsdiskussion</a>.</p>
<h3>Folgende Seiten in Listenansicht-Auswahlmen&#252;s nie anbieten</h3>
<p>Mit dem Filtertyp "Listenansicht-Auswahlmen&uuml;" erlauben Sie Endanwendern die Auswahl einer anderen Listenansicht f&uuml;r das verbundene Listenansicht-Webpart. Ansichtsseiten, deren URL-Pfad irgendeinen der hier angegebenen Teiltexte enth&auml;lt (einer pro Zeile), werden von Filtern dieses Typs NIE Endanwendern zur Auswahl angeboten.</p>
<p>Falls Sie diese Einstellung angepa&szlig;t haben, k&ouml;nnen Sie &uuml;ber den Link <b>Auf Standardwert zur&uuml;cksetzen</b> auf der Seite <i>Konfiguration</i> im <i>FilterZen-Studio</i> folgenden Standardwert wiederherstellen:</p>
<pre>/forms/combine.aspx<br/>/forms/repair.aspx<br/>/forms/webfldr.aspx</pre>
<h3>Externe Filtertypen</h3>
<p>Geben Sie zus&auml;tzliche oder von Drittanbietern entwickelte FilterZen-Filtertypen an, die FilterZen Filter-Webparts in dieser Farm zur Verf&uuml;gung gestellt werden sollen (einen pro Zeile nach dem Muster "voller Typname der roxority_FilterZen.FilterBase implementierenden Klasse, voller Assemblyname"). VORSICHT: durch Deinstallation einer Filtertyp-Assembly werden alle Filter-Webparts unbrauchbar, die den entsprechenden Filtertypen noch verwenden.</p>
<h3>Beim Merken von Filterwerten nur nach Filtername speichern (Webpart-&#252;bergreifende Wiederherstellung)</h3>
<p>FilterZen-Webparts k&ouml;nnen sich bei entsprechender Einrichtung <b>&#39;Zuletzt verwendete Filterwerte aller Benutzer merken&#39;</b>. Diese gespeicherten Werte sind werden standardm&auml;&szlig;ig dem aktuellen Benutzer, dem Filternamen sowie dem speichernden FilterZen-Webpart zugeordnet (also nur unter derselben Konstellation wiederhergestellt). Kreuzen Sie auf der Seite <i>Konfiguration</i> im <i>FilterZen-Studio</i> diese Option an, um stattdessen gespeicherte Filterwerte nur noch dem Benutzer und Filternamen zuzuordnen, wodurch Ihre Anwender Filterwerte desselben Namens &uuml;ber mehrere eigenst&auml;ndige FilterZen-Webparts hinweg wiederverwenden und weitergeben k&ouml;nnen.</p>
<h3>Speicherort f&#252;r &#39;Gemerkte zuletzt verwendete Filterwerte&#39;</h3>
<p>FilterZen-Webparts k&ouml;nnen sich bei entsprechender Einrichtung <b>&#39;Zuletzt verwendete Filterwerte aller Benutzer merken&#39;</b>. Standardm&auml;&szlig;ig wird versucht, diese Werte sowohl im Anwender-Browser als auch in der SharePoint-Inhaltsdatenbank zu speichern; Sie k&ouml;nnen dieses hybride Speichermodell hier jedoch anpassen. Clientseitige Cookies k&ouml;nnen jederzeit durch den Anwender gel&ouml;scht werden oder durch Unternehmens- bzw. Sicherheitsrichtlinien geblockt worden sein. Serverseitige Speicherung kann bei sehr gro&szlig;en Nutzerzahlen im Laufe der Zeit die Inhaltsdatenbank aufbl&auml;hen, oder in seltenen Konstellationen stillschweigend fehlschlagen durch administrativ selbst gegen&uuml;ber Elevated Code sehr restriktiv umgesetzte Abschirmungs- und Berechtigungskonzepte.</p>
<p><strong>W&auml;hlen Sie aus folgenden Optionen</strong> auf der Seite <i>Konfiguration</i> im <i>FilterZen-Studio</i>:</p>
<ul>
<li><i>Beide (empfohlen)</i></li>
<li><i>Serverseitige Inhaltsdatenbank</i></li>
<li><i>Clientseitige Browsercookies</i></li>
</ul>
<h3>Parameter aus URL entfernen</h3>
<p>Geben Sie die URL-Parameter an (einen pro Zeile), die FilterZen bei deren Verwendung aus der URL entfernen sollte (wenn die Webpart-Option <b>Webparteinstellungen durch URL-Parameter &uuml;berschreiben</b> angekreuzt ist).</p>
<h3>Die Webpartverbindungen-Men&#252;option &#39;Einzelnen Datenwert senden an&#39; aktivieren</h3>
<p>Ist diese Option aktiviert, treten FilterZen Filter-Webparts nicht nur als &#39;Filteranbieter&#39; und &#39;Datenzeilenanbieter&#39;, sondern auch als &#39;Dateneinzelwertanbieter&#39; auf. Dies ist normalerweise nicht erforderlich, da Datenzeilenanbieter immer auch als Dateneinzelwertanbieter eingesetzt werden k&ouml;nnen und dem Webpartseiten-Autor eine bessere Benutzeroberfl&auml;che zur Verf&uuml;gung stellen. Falls Sie sich unsicher sind, aktivieren Sie diese Option <i>nicht</i>.</p>
<h3>Standardm&#228;&#223;ig keine Einbindung der jQuery-Bibliothek v1.8.3 (NICHT empfohlen)</h3>
<p>Einige FilterZen-Benutzeroberfl&auml;chen erfordern die jQuery-Bibliothek und binden diese in die entsprechenden Seiten ein. Mehrfacheinbindung von jQuery kann manchmal zu Problemen f&uuml;hren. Kreuzen Sie auf der Seite <i>Konfiguration</i> im <i>FilterZen-Studio</i> diese Option an <i>nur</i>, wenn Ihre Masterseiten, Webpartseiten oder Drittanbietererweiterungen eigenst&auml;ndig, global (nicht nur in Einzelf&auml;llen) und unabh&auml;ngig von FilterZen ebenfalls jQuery einbinden, um FilterZen davon abzuhalten, jQuery einzubinden. Ist diese Option aktiviert, m&uuml;ssen Sie selbst&auml;ndig sicherstellen, dass jQuery (in einer Version neuer als 1.4 ABER &auml;lter als 1.9) in Seiten geladen wird, die FilterZen-Benutzeroberfl&auml;chen enthalten, andernfalls wird FilterZen unter Umst&auml;nden nicht mehr funktionieren. Dies ist eine globale Voreinstellung, die lokal ggf. noch einmal individuell &uuml;berschrieben werden kann.</p>
